#include "Game.h"

//-------------------------------------------------------------------------------------------------
#include "Direct3D9.h"
#include "Mesh.h"
#include "Define.h"

//-------------------------------------------------------------------------------------------------
namespace myGame {

//-------------------------------------------------------------------------------------------------
/// コンストラクタ
Game::Game()
	: mSceneManager()
	, mFps()
{
}

//-------------------------------------------------------------------------------------------------
/// アプリケーションのメインループ
/// @return falseを返すとメインループを抜けてアプリケーションが終了する
bool Game::mainLoop()
{
	// シーン処理
	mSceneManager.run();

	// fpsを調整する
	mFps.adjust();

	return true;
}

} // namespace
// EOF
