#include "Game.h"

//-------------------------------------------------------------------------------------------------
#include "Direct3D9.h"
#include "Mesh.h"
#include "Define.h"
#include "Mesh.h"
#include "DebugFont.h"

//-------------------------------------------------------------------------------------------------
namespace myGame {

//-------------------------------------------------------------------------------------------------
/// コンストラクタ
Game::Game()
	: mSceneManager()
{
	// シングルトンクラスを生成
	Mesh::getInst();
	DebugFont::getInst();
}

//-------------------------------------------------------------------------------------------------
/// アプリケーションのメインループ
/// @return falseを返すとメインループを抜けてアプリケーションが終了する
bool Game::mainLoop()
{
	// シーン処理
	mSceneManager.run();

	return true;
}

} // namespace
// EOF
