#include "MainLoop.h"

//-------------------------------------------------------------------------------------------------
#include "Define.h"

//-------------------------------------------------------------------------------------------------
namespace MyGame {

//-------------------------------------------------------------------------------------------------
/// コンストラクタ
MainLoop::MainLoop(LPDIRECT3DDEVICE9 a_pD3DDevice)
	: m_pD3DDevice(a_pD3DDevice)
{
}

//-------------------------------------------------------------------------------------------------
/// デストラクタ
MainLoop::~MainLoop()
{
}

//-------------------------------------------------------------------------------------------------
/// アプリケーションのメインループ
/// @return falseを返すとメインループを抜けてアプリケーションが終了する
bool MainLoop::loop()
{
	draw();
	return true;
}

//-------------------------------------------------------------------------------------------------
/// 描画
void MainLoop::draw()
{
	// Zバッファとバックバッファをクリア
	m_pD3DDevice->Clear(0, NULL, D3DCLEAR_TARGET | D3DCLEAR_ZBUFFER, Define::ClearColor, 1.0f, 0);

	// 描画開始
	if (SUCCEEDED(m_pD3DDevice->BeginScene())) {
		// 描画終了
		m_pD3DDevice->EndScene();
	}

	// バックバッファを表画面に描画
	m_pD3DDevice->Present(NULL, NULL, NULL, NULL);
}

} // namespace
// EOF
